// general message
"message.error.default" = "An error occurred. Please try again.";
"message.otp.required" = "Please enter OTP";
"message.cvv.required" = "Please enter CVV/CVC/CVN";
"invalid-authentication" = "Invalid authentication. Please try again.";
"message.error.no-supported-method" = "No supported payment method.";
"message.install-%@-app" = "We cannot open the application. You need to install %@ to complete the transaction.";
"message.open-%@-app" = "Open %@ app";
"messsge.invalid-input" = "Payoo: Invalid input.";

// qr code
"qrcode-method.guideline.step1" = "Login to Application\nChoose Scan QR code function";
"qrcode-method.guideline.step2" = "Scan QR code";
"qrcode-method.guideline.step3" = "Confirm information and finish transaction";
"qrcode-method.guideline.title" = "Guideline";
"qrcode-method.title" = "Scan QR code";

// qr pay transfer
"qrpay-transfer.note" = "Save QR code and use mobile banking application to pay or transfer using below information.";
"qrpay-transfer.order-no" = "Order No:";
"qrpay-transfer.amount" = "Amount:";
"qrpay-transfer.ref-no" = "Description:";
"qrpay-transfer.app-supported.title" = "Supported banking application";
"qrpay-transfer.payment-excess-amount-%@" = "You have transferred an extra amount of %@.
Please continue with payment to complete the transaction.";
"qrpay-transfer.payment-lack-of-amount-%@" = "You have transferred a missing amount of %@. Please continue with payment to complete the transaction.";
"qrpay-transfer.result-note" = "Transaction info will be updated based on actual transferred amount.";
"qrpay-transfer.refund-note" = "In case you want to cancel the transaction and refund, please contact our Customer Support for further support.";
"qrpay-transfer.buton.title.continue-payment" = "Continue payment";
"qrpay-transfer.order-info.amount" = "Transaction amount";
"qrpay-transfer.order-info.transfered-amount" = "Transferred amount";
"qrpay-transfer.order-info.excess-amount" = "Extra amount";
"qrpay-transfer.order-info.lack-of-amount" = "Missing amount";
"qrpay-transfer.order-info.actual-transferred-amount" = "Actual transferred amount";
"qrpay-transfer.order-info" = "Order info";
"qrpay-transfer.guideline.step1" = "Save QR image to your device's gallery";
"qrpay-transfer.guideline.step2" = "Open QR scan function on mobile banking application";
"qrpay-transfer.guideline.step3" = "Upload saved QR image from device's gallery";
"qrpay-transfer.guideline.step4" = "Check transaction info and proceed with payment";
"qrpay-transfer.share-qr-code" = "Share QR code";
"qrpay-transfer.save-qr-code" = "Save QR code";
"qrpay-transfer.save-qr-code-successfully" = "Saved QR image";
"qrpay-transfer.transfer-info" = "Transfer information";
"qrpay-transfer.account-no" = "Account no";
"qrpay-transfer.qrcode.ref-no-note" = "You need to enter exactly order information in order to pay successfully.";
"qrpay-transfer.confirm-leave-%@" = "You have paid %@ for an order with total amount of %@. Are you sure you want to leave and finish payment process?";
"qrpay-transfer.confirm-leave" = "Are you sure you want to leave the current payment process?";
"qrpay-transfer.leave" = "Leave";

// placeholder
"place-holder.%@-number-of-digits" = "%@ digits";
"place-holder.card-holder-name" = "At least 1 space between words";
"place-holder.card-input.phone" = "Receive support and promotion (if any)";
"place-holder.period" = "Please select period";

// title
"info.title-table.contact" = "CONTACT INFORMATION";
"info.title-table.card" = "CARD INFORMATION";
"info.title-table.payment" = "PAYMENT INFORMATION";
"info.title-table.recurring" = "RECURRING PAYMENT INFORMATION";

// fields
"fullname" = "Full name";
"issuance-date" = "Issuance date";
"expiry-date" = "Expiry date";
"expiry-date-hint" = "Please enter an expiration date on your card (if any)";
"card-holder-name" = "Cardholder name";
"phone" = "Phone number";
"phone-placeholder" = "Receiving support & promotion information";
"email" = "Email";
"email-placeholder" = "Receiving email containing payment information";
"card-type" = "Card type";
"payment" = "Payment";
"fee" = "Fee";
"total" = "Total";
"estimated-amount" = "Estimated amount";
"card-number" = "Card number";
"supported-banks" = "Supported banks";
"payment-code" = "Payment code";
"please-pay-by" = "Please pay by";
"order-no" = "Order No";
"cash-amount" = "Amount";
"order-info-note" = "You can take note or take the screen photo to save information if you don't receive SMS or email.";
"finding-store-note" = "After receiving the payment code, please give it to the cashier to pay at the nearest store:";
"period" = "Period";
"total-amount" = "Total amount";
"digits" = "digits";
"transaction-authentication" = "Transaction Authentication";
"internet-banking-note" = "Your card must be activated Online payment or Internet Banking services before processing transactions.";
"note" = "Note";
"copied-successfully" = "Copied successfully";
"show" = "Show";
"hide" = "Hide";
"contact-no" = "Contract No";
"payment-start-date" = "Payment start date";
"recurring-amount" = "Recurring amount";
"billing-date" = "Billing date";
"billing-cycle" = "Billing cycle";
"day-per-time" = "days/time";
"optional" = "Optional";

// general button title
"button.title.ok" = "OK";
"button.title.cancel" = "Cancel";
"button.title.close" = "Close";
"button.title.retry" = "Retry";
"button.title.continue" = "Continue";
"button.title.pay" = "Pay";
"button.title.leave" = "Leave";
"button.title.find-store-near-you" = "Find a store near you";
"button.title.submit" = "Submit";
"button.title.complete-payment" = "Complete Payment";
"button.title.share" = "Share";
"button.title.install" = "Install";
"button.title.open" = "Open";
"button.title.delete" = "Delete";
"button.title.change" = "Change";
"button.title.done" = "Done";

// general alert title
"alert.title.error" = "Error";
"alert.title.confirm" = "Confirm";
"alert.title.success" = "Success";
"alert.title.message" = "Message";
"alert.title.warning" = "Warning";

// screen title
"screen.title.domestic-card-number" = "Card number";
"screen.title.domestic-card-info" = "Card information";
"screen.title.international-card-info" = "Card information";
"screen.title.confirm" = "Confirmation";
"screen.title.select-payment-card" = "Select payment card";
"screen.title.contact-info" = "Contact information";
"screen.title.payment-code" = "Payment Code";
"screen.title.payment-result" = "Payment Result";
"screen.title.supported-applications" = "SUPPORTED APPLICATIONS";
"screen.title.qr-code" = "Scan QR code";
"screen.title.select-source" = "Select source";
"screen.title.select-periods" = "Select Period";
"screen.title.qr-bank" = "QR Bank";

// validate
"validate.enter-required-info" = "Value is required";
"validate.select-required-info" = "Value is required";
"validate.%@-is-not-international-card" = "%@ is not a domestic card number";
"validate.invalid" = "Invalid input";
"validate.invalid.card-number" = "Incorrect card number";
"validate.bankcode-%@-prefix-%@-not-supported" = "%@ %@ is currently not supported";
"validate.prefix-%@-not-supported" = "%@ is currently not supported.";
"validate.international-prefix-%@-not-supported" = "%@ is currently not supported";
"validate.invalid.card-number-range" = "Card number has from %@ to %@ digits. Please enter again";
"validate.invalid.card-number-length" = "Card number has %@ digits. Please enter again";
"validate.invalid-card-info-or-not-support" = "Card information is invalid or the used card is unsupported";
"validate.invalid-money-total" = "%@ accept to pay a order from %@ to %@";
"validate.bank-%@-not-support-installment-%@-prefix" = "%@ cards with the prefix number %@ are currently not supported for installment payment.";
"validate.bank-%@-min-%@-max-%@-amount-%@-installment" = "To apply instalment plan of %@, the order amount must be from %@ to %@";

// payment
"payment.finish-confirm" = "Your payment is being processed. Click \"Complete Payment\" if you have finshed all the steps.";
"payment.amount-under-min" = "Payment money is below the bank limit.";
"payment.amount-greater-max" = "Payment money is over the bank limit.";
"payment.deposit-times-greater-max-per-day" = "The deposit times are over the allowable limit of the bank.";
"payment.deposit-money-greater-max-per-day" = "Total paid money in a day is over the allowable limit of the bank.";
"payment.wallet-not-activated" = "Your e-Wallet is still not activated. Please check your mail box and activate your e-Wallet.";
"payment.wallet-locked" = "Your e-Wallet is temporarily locked. Please contact Customer Support for more information.";
"payment.wallet-locked-forever" = "Your e-Wallet is locked. Please contact Customer Support for more information.";
"payment.invalid-card-number" = "Card number is invalid. Please enter again.";
"payment.invalid-card-name" = "Card name is invalid. Please enter again.";
"payment.invalid-card-issuance-date" = "Issuance date is invalid. Please enter again.";
"payment.invalid-card-expiry-date" = "Expiry date is invalid. Please enter again.";
"payment.invalid-account" = "Bank account is invalid. Please enter again.";
"payment.expired-token" = "Your session has been expired. Please do it again.";
"payment.locked-card" = "Your card is expired or locked. Please contact issuer bank to get support.";
"payment.locked-account" = "Your account is locked. Please contact issuer bank to get support.";
"payment.card-not-registered" = "Your card is not registered (or not supported) for online transaction. Please contact issuer bank to get support.";
"payment.limited-payment" = "Your card/account does not have enough fund or exceed payment limit.";
"payment.money-not-enough" = "Your card/account does not have enough fund or exceed payment limit.";
"payment.invalid-card-info" = "Card information is not correct. Please check again.";
"payment.payment-fee-null" = "Service provider does not allow payment with transaction fee. Please use other payment methods.";
"payment.card-transtype-out-limit" = "Credit limit of card %@ is not enough to make payment (%@/%@).";
"payment.device-transtype-out-limit" = "Credit limit of this device is not enough to make payment (%@/%@).";
"payment.card-out-limit-app" = "Credit limit of card %@ is not enough to make payment (%@/%@).";
"payment.device-out-limit-app" = "Credit limit of this device is not enough to make payment (%@/%@).";
"payment.card-out-limit" = "Credit limit of card %@ is not enough to make payment (%@/%@).";
"payment.device-out-limit" = "Credit limit of this device is not enough to make payment for transaction (%@/%@).";
"payment.validity-greater-%d-months" = "The validity of the card must be at least %d month(s) for installment payment.";
"payment.validity-greater-installment" = "Installment payment must be less than the remaining validity of the card.";
"payment.validity-greater-or-equal-installment" = "Installment payment must be less than or equal the remaining validity of the card.";
"payment.order-expired" = "This order does not exist or has been expired.";
"payment.card-not-support-internal" = "For security reasons, your transaction will be redirected to mobile browser.";

// otp
"otp.invalid-repay" = "The OTP password input is not correct or expired. Please try again.";

// webview
"webview.close.confirm" = "Incomplete transaction. Are you sure you want exit?";

// save card option view
"label.save-card.description" = "Save card information for next payments.";

"payment-token.remove.confirm" = "Do you want to remove this card?";
"payment-token.remove.success" = "Remove card successfullly!";
"payment-token.saved-card-not-found" = "Not exist any saved card";

// pci
"pci-secure.description" = "Secured with PCI-DSS and ISO 27001";

// payment result
"time-unit-(second).title" = "s";
"customer-support.title" = "Customer Support";
"connected-with.title" = "Connected with";
"payment-success.title" = "Payment Success";
"payment-failed.title" = "Payment Failed";
"payment-uncompleted.title" = "Incomplete payment";
"time-remaining.title" = "Time Remaining:";
"powered-by" = "Powered by";

// payment order info
"order-info.close-processing-warning" = "Please DO NOT close this screen.";
"order-info.processing.title" = "Transaction Processing";
"order-info.time-left.title" = "Time left";
"order-info.timeout" = "An error occurred while processing your request. Sorry for the inconvenience. Please call 1900545478 for further support.";

//Selected period
"select-period.money-per-month" = "%@/month";
"select-period.subtitle" = "Your card is not supported for period %d months. Please select another period to continue transaction.";
"select-period.non-support-period" = "Your card is not supported for %d month term at the bank. Please check again or contact your card issuer for more details.";
"select-period.not-found-message" = "Installment period not found. Please check your order info again.";
